/*******************************************************************************
 *
 * Copyright (C) 2012 Jorge Aparicio <jorge.aparicio.r@gmail.com>
 *
 * This file is part of libstm32pp.
 *
 * libstm32pp is free software: you can redistribute it and/or modify it under
 * the terms of the GNU Lesser General Public License as published by the Free
 * Software Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * libstm32pp is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with libstm32pp. If not, see <http://www.gnu.org/licenses/>.
 *
 ******************************************************************************/

#pragma once

#include "common.hpp"

namespace adc {
  enum Address {
#ifdef STM32F1XX
    ADC1 = alias::APB2 + 0x2400,
    ADC2 = alias::APB2 + 0x2800,
    ADC3 = alias::APB2 + 0x3C00,
#else // STM32F1XX
    ADC1 = alias::APB2 + 0x2000,
    ADC2 = alias::APB2 + 0x2100,
    ADC3 = alias::APB2 + 0x2200,
    ADC = alias::APB2 + 0x2300,
#endif // STM32F1XX
  };

  struct Registers {
      __RW
      u32 SR;       // 0x00: Status
      __RW
      u32 CR1;      // 0x04: Control 1
      __RW
      u32 CR2;      // 0x08: Control 2
      __RW
      u32 SMPR[2];  // 0x0C: Sample time
      __RW
      u32 JOFR[4];  // 0x14: Injected channel data offset
      __RW
      u32 HTR;      // 0x24: Watchdog higher threshold
      __RW
      u32 LTR;      // 0x28: Watchdog lower threshold
      __RW
      u32 SQR[3];   // 0x2C: Regular sequence
      __RW
      u32 JSQR;     // 0x38: Injected sequence
      __RW
      u32 JDR[4];   // 0x3C: Injected data 1
      __RW
      u32 DR;       // 0x4C: Data
  };

#if defined STM32F2XX || \
    defined STM32F4XX
  struct CommonRegisters {
      __RW
      u32 CSR;  //0x00: Common status
      __RW
      u32 CCR;  //0x04: Common control
      __RW
      u32 CDR;  //0x08: Common regular data
  };
#endif

  /**
   * ADC status register (ADC_SR)
   * Address offset: 0x00
   * Reset value: 0x0000 0000
   **/
  namespace sr {
    enum {
      OFFSET = 0x00
    };

    /**
     * Bit 0 AWD: Analog watchdog flag
     * This bit is set by hardware when the converted voltage crosses the values programmed in
     * the ADC_LTR and ADC_HTR registers. It is cleared by software.
     * 0: No analog watchdog event occurred
     * 1: Analog watchdog event occurred
     **/
    namespace awd {
      enum {
        POSITION = 0,
        MASK = 1 << POSITION
      };
      enum States {
        NO_ANALOG_WATCHDOG_EVENT_OCURRED = 0 << POSITION,
        ANALOG_WATCHDOG_EVENT_OCURRED = 1 << POSITION,
      };
    }  // namespace awd

    /**
     * Bit 1 EOC: Regular channel end of conversion
     * This bit is set by hardware at the end of the conversion of a regular group of channels. It is
